docs/1c-export-2026-06-02/DataProcessors/ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.НалоговаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.НалоговаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьНаПринтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьРеестр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.НалоговаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.НалоговаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

docs/1c-export-2026-06-02/AccumulationRegisters/НДСПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПродаж</Name>
			<Comment>(Регл) НДС, выставляемый в документах покупателям</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетовРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/СобытияНДСПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СобытияНДСПродаж</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРозничнойВыручки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РализацияРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/DataProcessors/ФормированиеНалоговыхНакладныхПоРозницеБезНоменклатурногоСостава/Ext/ObjectModule.bsl
Процедура ЗаполнитьПоОстаткам(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", КонецДня(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВозвратнаяТара", Ложь);
	Запрос.УстановитьПараметр("СтавкиНДС", ДокументОбъект.ОпределитьДопустимыеСтавкиНДС());
	
	СобытиеНДС = Перечисления.СобытияНДСПродаж.РозничнаяВыручка; 
	
	Запрос.УстановитьПараметр("СобытиеНДС", СобытиеНДС);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкаНДС,
	|	СуммаВзаиморасчетовРеглОстаток,	
	|	НДСОстаток
	|ИЗ
	|	РегистрНакопления.НДСПродаж.Остатки(&МоментВремени, 
	|											  			Организация 		= &Организация 
	|											 		  И ДоговорКонтрагента 	= &ДоговорКонтрагента 
	|													  И СтавкаНДС 			В (&СтавкиНДС)
	|													  И СобытиеНДС  		= &СобытиеНДС 
	|													  И ВозвратнаяТара 		= &ВозвратнаяТара) КАК НДСПриобретенийОстатки
	|ГДЕ
	|	СуммаВзаиморасчетовРеглОстаток >= 0
	|   И НДСОстаток >= 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Прочее.Добавить();
		
		НоменклатураДляЗаполнения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НоменклатураДляЗаполненияНалоговыхНакладных");
		Если ЗначениеЗаполнено(НоменклатураДляЗаполнения) Тогда
			ЗаполнитьУКТВЭДВСтрокеТоваров(НоменклатураДляЗаполнения,СтрокаТабличнойЧасти);
		Иначе
	    	СтрокаТабличнойЧасти.Наименование = "Розничные продажи";
		КонецЕсли; 
		
		СтрокаТабличнойЧасти.СтавкаНДС 		= Выборка.СтавкаНДС;
		СтрокаТабличнойЧасти.Количество		= 1;
		
		СтрокаТабличнойЧасти.СуммаНДС		= Выборка.НДСОстаток;
			
		СтрокаТабличнойЧасти.Сумма 			= Выборка.СуммаВзаиморасчетовРеглОстаток;
		СтрокаТабличнойЧасти.Цена			= СтрокаТабличнойЧасти.Сумма;
		
		ДокументОбъект.ЗаполнитьСтатьюКнигиПродаж(СтрокаТабличнойЧасти, "Прочее");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПриложение2ПоОстаткам(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", КонецДня(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВозвратнаяТара", Ложь);
	Запрос.УстановитьПараметр("СтавкиНДС", ДокументОбъект.ОпределитьДопустимыеСтавкиНДС());
	
	СобытиеНДС = Перечисления.СобытияНДСПродаж.ВозвратРозничнойВыручки;		  
	Запрос.УстановитьПараметр("СобытиеНДС", СобытиеНДС);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкаНДС,
	|	СуммаВзаиморасчетовРеглОстаток,	
	|	НДСОстаток
	|ИЗ
	|	РегистрНакопления.НДСПродаж.Остатки(&МоментВремени, 
	|											  			Организация 		= &Организация 
	|											 		  И ДоговорКонтрагента 	= &ДоговорКонтрагента 
	|													  И СтавкаНДС 			В (&СтавкиНДС)
	|													  И СобытиеНДС  		= &СобытиеНДС 
	|													  И ВозвратнаяТара 		= &ВозвратнаяТара) КАК НДСПродажОстатки	
	|ГДЕ
	|  СуммаВзаиморасчетовРеглОстаток >= 0
	|   И НДСОстаток >= 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Прочее.Добавить();
			
		НоменклатураДляЗаполнения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НоменклатураДляЗаполненияНалоговыхНакладных");
		Если ЗначениеЗаполнено(НоменклатураДляЗаполнения) Тогда
			ЗаполнитьУКТВЭДВСтрокеТоваров(НоменклатураДляЗаполнения,СтрокаТабличнойЧасти);
		Иначе
	    	СтрокаТабличнойЧасти.Наименование = "Розничные продажи (возврат)";
		КонецЕсли; 

		
		СтрокаТабличнойЧасти.СтавкаНДС			= Выборка.СтавкаНДС;
		СтрокаТабличнойЧасти.ИзменениеСуммыНДС	= Выборка.НДСОстаток;
		
		СтрокаТабличнойЧасти.ИзменениеСуммы 	= Выборка.СуммаВзаиморасчетовРеглОстаток;
			
		// Нужно инвертировать суммы
		СтрокаТабличнойЧасти.ИзменениеСуммыНДС 	= -СтрокаТабличнойЧасти.ИзменениеСуммыНДС;
		СтрокаТабличнойЧасти.ИзменениеСуммы	   	= -СтрокаТабличнойЧасти.ИзменениеСуммы;
					
		ДокументОбъект.ЗаполнитьСтатьюКнигиПродаж(СтрокаТабличнойЧасти, "Прочее");
			
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУКТВЭДВСтрокеТоваров(НоменклатураДляЗаполнения,СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Наименование 	=  НоменклатураДляЗаполнения.НаименованиеПолное;
	ЗначениеНоменклатураГТД = НоменклатураДляЗаполнения.НоменклатураГТД;
	Если ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
		СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД.КодУКТВЭД;
	ИначеЕсли ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.КлассификаторУКТВЭД") Тогда
		СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД;
	КонецЕсли;
		
КонецПроцедуры
